#+BEGIN_COMMENT
.. title: Longest Common Subsequence
.. slug: longest-common-subsequence
.. date: 2022-07-13 17:02:30 UTC-07:00
.. tags: dynamic programming,algorithms
.. category: Optimization
.. link: 
.. description: A look at finding the longest common subsequence of two sequences.
.. type: text
.. has_pseudocode: yes
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-c88b7295-2cb6-49dc-83da-f618b31048c9-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* Printing The Sequence

#+begin_export html
<pre id="print-lcs-algorithm" style="display:hidden;">
\begin{algorithm}
\caption{Longest Common Subsequence Printer}
\begin{algorithmic}
\INPUT $b$: Table of directions from \textsc{LCS-Length}
\INPUT $X$: Sequence of elements
\INPUT $Y$: Sequence of elements
\INPUT $i$: Row number in $b$
\INPUT $j$: Column number in $b$
\PROCEDURE{Print-LCS}{$b, X, i, j$}
\IF {\(i = 0 \text{ or } j = 0\)}
    \RETURN
\ENDIF
\IF {\(b[i, j] = "\nwarrow" \)}
    \STATE \textsc{PrintLCS}(\(b, X, i - 1, j - 1\))
    \STATE \textsc{Print}(\(X_i\))
\ELSEIF {\(b[i, j] = "\uparrow" \)}
    \STATE \textsc{PrintLCS}(\(b, X, i- 1, j \))
\ELSE
    \STATE \textsc{PrintLCS}(\(b, X, i, j - 1\))
\ENDIF
\ENDPROCEDURE
\end{algorithmic}
\end{algorithm}
</pre>
#+end_export

#+begin_src python :results output :exports both
lcs.print_longest()
#+end_src

#+RESULTS:
: B
: C
: B
: A

